docs.org
#+title: PIACC data processing

#+hugo_base_dir: ./docs
#+hugo_front_matter_format: toml
#+hugo_level_offset: 0

# https://orgmode.org/manual/Export-Settings.html#Export-Settings
#+options: H:10 num:nil toc:t \n:nil @:t ::t |:t ^:nil ^:{} -:t f:t *:t <:t ':nil -:nil pri:t
#+options: TeX:t LaTeX:t skip:nil d:nil todo:nil pri:nil tags:nil

#+startup: overview noinlineimages logdone indent

#+latex_class: article
#+latex_class_options: [letterpaper,11pt]

#+latex_compiler: pdflatex

# comment out for reveal.js
# #+setupfile: ~/setup/my-theme-readtheorg.setup
#+setupfile: ~/org/latex_header.setup
#+setupfile: ~/org/orgmode_header.setup

#+property: header-args :eval never-export
#+property: header-args:R :eval never-export
#+property: header-args:ein :session localhost
#+property: header-args:jupyter-python :session *jupyter-piacc* :kernel tf

#+BEGIN_SRC emacs-lisp
  (jyun/org-latex-set-options 2.5)
#+END_SRC
* TODOs :noexport:
:PROPERTIES:
:EXPORT_FILE_NAME: _index
:EXPORT_HUGO_SECTION: todo
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :chapter true
:EXPORT_HUGO_WEIGHT: 1
:EXPORT_TITLE: TODO
:END:

** pattern discovery
- divide tau by 1) number of actions
- use 2) total time for visualization
- 1) divided by 2)
- find persons (small # of actions, large # of actions: right vs wrong)
  - 시간이 많이 걸리고 맞은사람 vs 적게 걸리고 맞은 사람.
  - 적은 액션으로 맞은 사람 vs 많은 액션으로 틀린 사람.
- 무조건 빨리 푼다고 잘하는게 아니고, 느리거나 혹은 상이한 액션 개수로 정답에 이르는 프로세스 발견에 초점.
** justification + what item to use
select a few items fulfilling the justification sheme!

https://cran.r-project.org/web/packages/tidyLPA/vignettes/Introduction_to_tidyLPA.html
분화된 그룹 (더 많은 그룹) 이 있으면 OK

observed covaritates + response group classification
observed covaritates + tau and theta + response group classification

*** no gender effect?
Suppose a gender variable was significant RF for tau and theta.
this could be because of effect of other covariates
plot gender against tau or theta, and see if there was diff.
after control gender no significant
find gender diff in EDA, after age control no difference.

https://data-edu.github.io/tidyLPA/reference/AHP.html

Some items show the gender difference. However, they are not chosen ones for the further analysis.
** cluster analysis
characteristics of newly discovered groups using hidden traits
what these groups can tell you about???

** model validation
see if we can use model validation tech for mutil-state survival model.
See [[id:1237b9e6-288a-413a-a484-e535d817a3c1][multi-state survival model validation]]: posterior predictive checking

